<a href="https://colab.research.google.com/github/santosh9382/python_SQLCODE/blob/main/sqlitedb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

CREATE DATABASE

In [ ]:
import sqlite3

conn = sqlite3.connect("test24.db")

print ("Opened database successfully")

Opened database successfully

CREATE TABLE

In [ ]:
import sqlite3

conn = sqlite3.connect('test24.db')
print ("Opened database successfully");

conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print ("Table created successfully");

Opened database successfully
Table created successfully

INSERT QUERY

In [ ]:
import sqlite3

conn = sqlite3.connect('test24.db')
print ("Opened database successfully");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()
print("Records created successfully") ;
conn.close()

Opened database successfully

OperationalError: table COMPANY already exists

In [ ]:
import sqlite3

conn = sqlite3.connect('test24.db')
print ("Opened database successfully");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()
print("Records created successfully") ;
conn.close()

Opened database successfully
Records created successfully

In [ ]:
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

conn.commit()
print("Records created successfully") ;
conn.close()

Records created successfully

SELECT QUERY

In [ ]:
import sqlite3

conn = sqlite3.connect('test24.db')
print ("Opened database successfully");

cursor = conn.execute("SELECT * from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[3], "\n")

print("Operation done successfully")
conn.close()

Opened database successfully
ID =  2
NAME =  Allen
ADDRESS =  25
SALARY =  Texas

ID =  3
NAME =  Teddy
ADDRESS =  23
SALARY =  Norway

ID =  4
NAME =  Mark
ADDRESS =  25
SALARY =  Rich-Mond

Operation done successfully

UPDATE DATA

In [ ]:
import sqlite3

conn = sqlite3.connect('test1.db')
print("Opened database successfully") ;

conn.execute("UPDATE COMPANY set SALARY = 25000.00 where ID = 2")
conn.commit()
print("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[3], "\n")

print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows updated : 1
ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  25000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully

In [ ]:
import sqlite3

conn = sqlite3.connect('test24.db')
print("Opened database successfully") ;

conn.execute("UPDATE COMPANY set SALARY = 50000 where id=2 or id=3")
conn.commit()
print("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT * from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[4], "\n")

print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows updated : 2
ID =  2
NAME =  Allen
ADDRESS =  25
SALARY =  50000.0

ID =  3
NAME =  Teddy
ADDRESS =  23
SALARY =  50000.0

ID =  4
NAME =  Mark
ADDRESS =  25
SALARY =  85000.0

Operation done successfully

In [ ]:
import sqlite3

conn = sqlite3.connect('test24.db')
print("Opened database successfully") ;

conn.execute("delete from COMPANY where id=2")
conn.commit()
print("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT * from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[4], "\n")

print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows updated : 1
ID =  3
NAME =  Teddy
ADDRESS =  23
SALARY =  50000.0

ID =  4
NAME =  Mark
ADDRESS =  25
SALARY =  85000.0

Operation done successfully